# Data Cleaning and Preparation

In [1]:
import numpy as np
import pandas as pd
# Set num of rows to display

PREVIOUS_MAX_ROWS = pd.options.display.max_rows
pd.options.display.max_rows = 20

# for replication
np.random.seed(12345)
import matplotlib.pyplot as plt
plt.rc('figure', figsize=(10, 6))
np.set_printoptions(precision=4, suppress=True)

## Handling Missing Data

In [2]:
#Pandas uses NaN (i.e.-Not a number) to represent missing data

#Create string data with an nan value

# minsing value nan 'not a number' in panda
string_data = pd.Series(['aardvark', 'artichoke', np.nan, 'avocado']) 
print(string_data)

# like is.na() is R
# for subset data 
print(string_data.isnull())

0     aardvark
1    artichoke
2          NaN
3      avocado
dtype: object
0    False
1    False
2     True
3    False
dtype: bool

In [3]:
# Base Python code uses the "None" value, different from pandas !!!
string_data[0] = None 

# Pandas isnull() will recognize python's "None" as null
string_data.isnull()

0     True
1    False
2     True
3    False
dtype: bool

Other methods for handling missing data include: dropna(), fillna(), and notnull()

### Filtering Out Missing Data

In [4]:
# dropna() will delete missing values in a series

from numpy import nan as NA
data = pd.Series([1, NA, 3.5, NA, 7])

# na.rm = T
data.dropna()

0    1.0
2    3.5
4    7.0
dtype: float64

In [7]:
# notnul() return boolean values
data[data.notnull()]

0    1.0
2    3.5
4    7.0
dtype: float64

In [5]:
# Works on data frames as well...

data = pd.DataFrame([[1., 6.5, 3.], [1., NA, NA],
                     [NA, NA, NA], [NA, 6.5, 3.]])
cleaned = data.dropna()

data # look at full data

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [6]:
cleaned #look at cleaned data after using dropna()

     0    1    2
0  1.0  6.5  3.0

In [7]:

#Create some new data for next section

df = pd.DataFrame(np.random.randn(7, 3))
df.iloc[:4, 1] = NA
df.iloc[:2, 2] = NA
display(df)

# drop all the NAs
df.dropna()

          0         1         2
0 -0.204708       NaN       NaN
1 -0.555730       NaN       NaN
2  0.092908       NaN  0.769023
3  1.246435       NaN -1.296221
4  0.274992  0.228913  1.352917
5  0.886429 -2.001637 -0.371843
6  1.669025 -0.438570 -0.539741

          0         1         2
4  0.274992  0.228913  1.352917
5  0.886429 -2.001637 -0.371843
6  1.669025 -0.438570 -0.539741

### Filling In Missing Data

In [19]:
# substitute NA with 0
df.fillna(0) # replace missing values with zeroes

          0         1         2
0  0.476985  0.000000  0.000000
1 -0.577087  0.000000  0.000000
2  0.523772  0.000000  1.343810
3 -0.713544  0.000000 -2.370232
4 -1.860761 -0.860757  0.560145
5 -1.265934  0.119827 -1.063512
6  0.332883 -2.359419 -0.199543

In [20]:
# fro column 1, fill with 0.5; for column to fill with 0
df.fillna({1: 0.5, 2: 0}) #use dictionary to replace with unique values per column

          0         1         2
0  0.476985  0.500000  0.000000
1 -0.577087  0.500000  0.000000
2  0.523772  0.500000  1.343810
3 -0.713544  0.500000 -2.370232
4 -1.860761 -0.860757  0.560145
5 -1.265934  0.119827 -1.063512
6  0.332883 -2.359419 -0.199543

In [22]:
 # inplace = True, overwrite the data set, otherwise just print or create a new object
df.fillna(0, inplace=True)
df

          0         1         2
0  0.476985  0.000000  0.000000
1 -0.577087  0.000000  0.000000
2  0.523772  0.000000  1.343810
3 -0.713544  0.000000 -2.370232
4 -1.860761 -0.860757  0.560145
5 -1.265934  0.119827 -1.063512
6  0.332883 -2.359419 -0.199543

In [23]:
# Build new dataset for next section

df = pd.DataFrame(np.random.randn(6, 3))
df.iloc[2:, 1] = NA
df.iloc[4:, 2] = NA
df

          0         1         2
0 -1.541996 -0.970736 -1.307030
1  0.286350  0.377984 -0.753887
2  0.331286       NaN  0.069877
3  0.246674       NaN  1.004812
4  1.327195       NaN       NaN
5  0.022185       NaN       NaN

In [24]:
# fill from previous column value
df.fillna(method='ffill')

          0         1         2
0 -1.541996 -0.970736 -1.307030
1  0.286350  0.377984 -0.753887
2  0.331286  0.377984  0.069877
3  0.246674  0.377984  1.004812
4  1.327195  0.377984  1.004812
5  0.022185  0.377984  1.004812

In [25]:
#fill with mean
data = pd.Series([1., NA, 3.5, NA, 7])
# this is a pd. series, in real-life, refer to column
data.fillna(data.mean())

0    1.000000
1    3.833333
2    3.500000
3    3.833333
4    7.000000
dtype: float64

## Data Transformation

### Removing Duplicates

In [26]:
data = pd.DataFrame({'k1': ['one', 'two'] * 3 + ['two'],
                     'k2': [1, 1, 2, 3, 3, 4, 4]})
data

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4
6  two   4

In [27]:
data.duplicated() # find duplicate combinations of observation values

0    False
1    False
2    False
3    False
4    False
5    False
6     True
dtype: bool

In [28]:
data.drop_duplicates() # last observation deleted

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4

In [31]:
data['v1'] = range(7) #add new variable
data

    k1  k2  v1
0  one   1   0
1  two   1   1
2  one   2   2
3  two   3   3
4  one   3   4
5  two   4   5
6  two   4   6

In [32]:
data.drop_duplicates(['k1']) # drop duplicates per column

    k1  k2  v1
0  one   1   0
1  two   1   1

### Replacing Values

In [33]:
data = pd.Series([1., -999., 2., -999., -1000., 3.])
data

0       1.0
1    -999.0
2       2.0
3    -999.0
4   -1000.0
5       3.0
dtype: float64

In [34]:
# recode the data use .replace
data.replace(-999, np.nan) # replace particular values

0       1.0
1       NaN
2       2.0
3       NaN
4   -1000.0
5       3.0
dtype: float64

In [35]:
data.replace([-999, -1000], np.nan) # replace within a range of values

0    1.0
1    NaN
2    2.0
3    NaN
4    NaN
5    3.0
dtype: float64